In [1]:
import pandas as pd
import numpy as np

In [21]:
dict = {
    'first_name': ['Brian', 'Jadon', 'Joy', 'Betty', 'Silas', 'Ashford'],
    'last_name': ['Muthuure', 'Kimathi', 'Kathambi', 'Mukami', 'Njagi', 'Kimathi'],
    'email': ['brianmuthuure@gmail.com', 'jadon@gmail.com', 'joy@gmail.com', 'mukami@gmail.com', 'njagi@gmail.com', 'kimathi@gmail.com'],
    'birthday': ['1997-12-01', '2001-03-24', '2009-8-21', '1998-05-22', '1972-06-13', '2000-08-22']
}

In [22]:
df = pd.DataFrame(dict)

In [23]:
df

  first_name last_name                    email    birthday
0      Brian  Muthuure  brianmuthuure@gmail.com  1997-12-01
1      Jadon   Kimathi          jadon@gmail.com  2001-03-24
2        Joy  Kathambi            joy@gmail.com   2009-8-21
3      Betty    Mukami         mukami@gmail.com  1998-05-22
4      Silas     Njagi          njagi@gmail.com  1972-06-13
5    Ashford   Kimathi        kimathi@gmail.com  2000-08-22

In [24]:
df.set_index('email', inplace=True)

In [25]:
df.loc['brianmuthuure@gmail.com']

first_name         Brian
last_name       Muthuure
birthday      1997-12-01
Name: brianmuthuure@gmail.com, dtype: object

In [26]:
df.loc['brianmuthuure@gmail.com', 'last_name']

'Muthuure'

In [27]:
df.reset_index(inplace=True)

In [28]:
df

                     email first_name last_name    birthday
0  brianmuthuure@gmail.com      Brian  Muthuure  1997-12-01
1          jadon@gmail.com      Jadon   Kimathi  2001-03-24
2            joy@gmail.com        Joy  Kathambi   2009-8-21
3         mukami@gmail.com      Betty    Mukami  1998-05-22
4          njagi@gmail.com      Silas     Njagi  1972-06-13
5        kimathi@gmail.com    Ashford   Kimathi  2000-08-22

In [29]:
df.loc[0]

email         brianmuthuure@gmail.com
first_name                      Brian
last_name                    Muthuure
birthday                   1997-12-01
Name: 0, dtype: object

In [30]:
df.loc[0 , ['email', 'first_name']]

email         brianmuthuure@gmail.com
first_name                      Brian
Name: 0, dtype: object

In [31]:
df['last_name'] == 'Kimathi'

0    False
1     True
2    False
3    False
4    False
5     True
Name: last_name, dtype: bool

In [32]:
filt = (df['last_name'] == 'Kimathi') | (df['first_name'] =='Brian')

In [33]:
df.loc[filt, 'email']

0    brianmuthuure@gmail.com
1            jadon@gmail.com
5          kimathi@gmail.com
Name: email, dtype: object

In [34]:
df.loc[filt]

                     email first_name last_name    birthday
0  brianmuthuure@gmail.com      Brian  Muthuure  1997-12-01
1          jadon@gmail.com      Jadon   Kimathi  2001-03-24
5        kimathi@gmail.com    Ashford   Kimathi  2000-08-22

In [35]:
from datetime import datetime, date

In [38]:
def age(born):
    born = datetime.strptime(born, "%Y-%m-%d").date()
    today = date.today()
    return today.year - born.year - ((today.month, today.day) < (born.month, born.day))

In [39]:
df['age'] = df['birthday'].apply(age)

In [40]:
df

                     email first_name last_name    birthday  age
0  brianmuthuure@gmail.com      Brian  Muthuure  1997-12-01   23
1          jadon@gmail.com      Jadon   Kimathi  2001-03-24   20
2            joy@gmail.com        Joy  Kathambi   2009-8-21   12
3         mukami@gmail.com      Betty    Mukami  1998-05-22   23
4          njagi@gmail.com      Silas     Njagi  1972-06-13   49
5        kimathi@gmail.com    Ashford   Kimathi  2000-08-22   21

In [43]:
filt = df['age'] > 21

In [45]:
df.loc[filt, ['email', 'first_name']]

                     email first_name
0  brianmuthuure@gmail.com      Brian
3         mukami@gmail.com      Betty
4          njagi@gmail.com      Silas